{
  "01": "The TCP/IP model is the foundation of modern networking, providing a framework that explains how data moves across networks like the internet. It is structured into five logical layers—Physical, Data Link, Network, Transport, and Application. Each layer has a distinct role: from moving raw bits across wires at the Physical layer, to ensuring reliable communication and meaningful interactions at the Application layer. This layered design allows systems from different vendors and technologies to interoperate, which is why TCP/IP became the universal standard for networking. \n\n When introducing it in class, it’s helpful to emphasize that the model works “bottom-up.” The lower layers (Physical and Data Link) handle how data physically travels, the Network layer focuses on addressing and routing using IP, the Transport layer (with TCP and UDP) ensures delivery and error handling, and the Application layer is where user-facing services like email, web, or streaming live. Together, these five layers form a streamlined yet powerful model that helps students understand not just the what of networking, but also the how and why.",
  "02": "This slide highlights how employers often use basic networking questions to quickly gauge a candidate’s technical skills, even at the HR screening stage. Simple but fundamental topics like the meaning of TCP/IP, the role of layer 3, the difference between MAC and IP addresses, or troubleshooting a common problem like connecting to Facebook can reveal whether someone has a working understanding of networks. By the end of the networking portion of this class, you should feel confident answering questions like these clearly and directly.",
  "03": "Here is a common problem that comes into a NOC (network operations center) - a user cannot get to a website.  Engineers use the TCP/IP model to triage the problem",
  "04": "Layer 1 – Physical: Transmits raw bits as electrical signals, light pulses, or radio waves across the physical medium. \n\n Layer 2 – Data Link: Groups bits into frames and manages access to the physical medium using MAC addresses.\n\nLayer 3 – Network: Handles logical addressing and routing, using IP to move packets across multiple networks. \n\nLayer 4 – Transport: Ensures reliable (TCP) or fast, connectionless (UDP) delivery of data between applications.\n\nLayer 5 – Application: Provides the interface for user-level services such as web browsing, email, and file transfer.",
  "05": "Did you get the answers?  They are: \n\nRequests/responds with the Facebook HTML page? → Application Layer (Layer 5) – This is where protocols like HTTP(S) operate to deliver and render web content.\n\nConnects my Mom’s computer to her wireless router? → Data Link Layer (Layer 2) – The Wi-Fi connection and MAC addressing handle local communication with the router.\n\nConnects my Mom’s computer to the Facebook computer? → Network Layer (Layer 3) – IP addressing and routing forward packets across networks from her device to Facebook’s servers.\n\nSends the electrical message → Physical Layer (Layer 1) – Actual transmission of bits as signals over cables or radio waves.\n\nProvides quality control: ensure her request reaches Facebook → Transport Layer (Layer 4) – TCP ensures reliable delivery, error checking, and retransmission if needed.",
  "06": "A network is a collection of interconnected devices—such as computers, phones, servers, and routers—that share information and resources using communication protocols. At its core, a network enables data to move between devices, whether it’s two machines in the same room or billions of devices worldwide through the internet. The purpose is always the same: to create pathways that allow devices to exchange data efficiently, reliably, and securely.",
  "07": "Business Data Communications refers to the technologies, systems, and processes organizations use to exchange information electronically. It covers the transmission of data—such as emails, files, transactions, and applications—across internal networks and external connections, ensuring that employees, customers, and partners can access and share information securely, efficiently, and reliably to support business operations.\n\nThe Internet is the global network of interconnected computers and devices that communicate using the TCP/IP protocol suite. It provides the infrastructure for services like the World Wide Web, email, streaming, and cloud applications, allowing billions of users worldwide to exchange data, access information, and connect with each other in real time.",
  "08": "Circuit switching is a method of communication where a dedicated communication path is established between two devices for the duration of a session. All data travels along this fixed path, much like a traditional telephone call, where the connection stays open until one side hangs up. This approach guarantees consistent bandwidth and predictable performance, but it can be inefficient because the reserved circuit remains unavailable to others even when no data is being transmitted.",
  "09": "Circuit switching has several drawbacks that make it poorly suited for today’s data-driven networks. Because a dedicated channel is reserved for the entire duration of a connection, capacity is wasted whenever no data is being transmitted, which is common with bursty computer traffic. Setup time is also required to establish a connection before any communication can occur, adding delay. Circuit-switched networks were designed for constant, real-time voice traffic, but modern communication is dominated by data, which is variable in speed and volume—doubling in efficiency every few years. This mismatch makes circuit switching increasingly inefficient. In addition, circuit-switched networks are vulnerable: if a switching office loses power or a link is cut, all circuits depending on that path are lost. Finally, in times of disaster or heavy demand, circuits may be completely unavailable, whereas packet-switched networks can reroute dynamically and continue operating. These limitations highlight why circuit switching has largely been replaced by packet switching in modern networks.",
  "10": "Packet switching was developed to solve the inefficiencies of circuit switching by breaking data into small, independent packets that are sent across a network without requiring a dedicated path. Each packet contains addressing information that allows routers to forward it along the best available route, and packets from the same message may even take different paths before being reassembled at the destination. This approach eliminates wasted capacity, since network links are shared dynamically among many users, and it avoids the long setup times required by circuit-switched connections.\n\nAnother major advantage is resilience: if one path or switching device fails, packets can be rerouted automatically through alternate routes, keeping communication alive even during failures or congestion. Packet switching also aligns naturally with the bursty, high-speed nature of computer data, where information is transmitted in irregular bursts rather than a constant stream. By allowing resources to be shared and traffic to adapt, packet switching became the foundation of modern data networks and the internet.",
  "11": "This slide illustrates the key difference between circuit switching and packet switching. In circuit switching, a dedicated path is established between sender and receiver for the entire communication, meaning all data follows the same route but resources are locked and wasted when not in use. In contrast, packet switching breaks data into smaller packets that can travel independently across multiple paths to the destination, where they are reassembled in order. This makes packet switching far more efficient, as it allows networks to dynamically share resources, reroute around failures, and handle bursty computer traffic more effectively. It is this flexibility and efficiency that makes packet switching the foundation of modern data networks and the internet.",
  "12": "This slide uses the analogy of a letter to explain how packets are structured in a network. Just like a letter has an envelope with addressing information and a body with the actual message, a packet is made up of a header and a body. The header contains control information such as the sender and receiver addresses, which ensures the packet is delivered correctly across the network. The body contains the actual data being sent, similar to the content of the letter. This process, known as encapsulation, allows data to be wrapped with the necessary delivery information so that it can move efficiently and reliably from the source to the destination.",
  "13": "The TCP 3-way handshake is the process used to establish a reliable connection between two devices before data is exchanged. First, the client sends a SYN (synchronize) message to the server to request a connection. The server responds with a SYN-ACK (synchronize-acknowledge) message to confirm it received the request and is ready to communicate. Finally, the client replies with an ACK (acknowledge), completing the handshake. At this point, both sides have agreed on initial sequence numbers and are synchronized, ensuring that data can be transmitted reliably in both directions.",
  "14": "Circuit switching creates a dedicated communication path between two devices for the entire session, guaranteeing consistent bandwidth but wasting capacity when no data is sent and making the connection vulnerable to failures. Packet switching, by contrast, breaks data into packets that are routed independently across shared network paths, allowing for more efficient use of resources, greater flexibility, and resilience—making it the foundation of modern computer networks and the internet.",
  "15": "Packet switching makes networks more efficient and reliable by breaking a message into smaller pieces, called packets, and sending them across the network independently. Each packet carries information about where it came from, where it is going, and how it fits into the overall message. Instead of always following one fixed path, packets can move across different paths and still arrive at the destination, which makes the system more flexible and less likely to fail if one path has a problem.\n\nThe tradeoff is that this process is more complex. The receiving computer has to put the packets back together in the right order, and if any packets are missing or damaged, it must request that they be sent again. Because there are so many steps involved—splitting the message, labeling packets, moving them across the network, reassembling them, and checking for errors—networking is organized into layers in the TCP/IP model. Each layer has a specific role, making the process easier to understand and manage.",
  "16": "This slide shows the different kinds of information that need to be included with user data in order for communication to work over a packet-switched network. Beyond the actual content being sent, packets also carry error checking information to detect problems, a destination address so the network knows where to deliver it, a sequence number so packets can be put back in the right order, and sometimes user commands to control how the connection operates. These extra fields create overhead, but they are essential to ensure reliable delivery. Since no single function can handle all of these responsibilities at once, they are divided logically into different layers. This leads directly into the TCP/IP model, where each layer has a specific role in making sure data gets from one device to another correctly and efficiently.",
  "17": "This slide ties everything together by mapping the networking tasks and header information we just discussed into the formal 5-layer TCP/IP model. Each layer has a specific role: the Physical layer handles raw signaling, the Data Link layer provides local error control, the Network layer (IP) assigns and interprets addresses to move packets between devices, the Transport layer (TCP) ensures packets are sequenced and reassembled correctly, and the Application layer represents user-facing needs and commands. Thinking in terms of layers makes the complexity of networking manageable—each layer focuses on one part of the job, while working together to deliver data reliably from one end to the other.",
  "18": "This slide gives a simplified picture of how the TCP/IP layers work together to move data from one person to another. At the top, Mike types a message at the Application layer, which is then broken into chunks by the Transport layer. The Network layer places each chunk into a packet with addressing information, and the Data Link layer wraps that packet into a frame for local delivery. Finally, the Physical layer converts it into bits that travel across the medium. On the receiving end, Alice’s computer reverses the process—converting bits back into frames, frames into packets, and packets into usable data—until she sees the original message. This layered process keeps communication organized, reliable, and understandable.",
  "19": "This slide provides a more detailed view of how the TCP/IP model works end-to-end between two hosts. On each side, applications communicate down through the stack: the Application layer specifies user needs, the Transport layer (TCP) manages logical connections and ensures reliable delivery, and the Network layer (IP) assigns global addresses so data can move across different networks. At the bottom, the Network Access/Physical layers handle the actual transmission of bits into the local network.\n\nThe diagram also highlights how devices in the middle, such as a router, operate: the router uses IP to forward packets between networks but does not process the application or transport information. Logical connections (like TCP sessions) appear end-to-end between hosts, while physical and link-level connections are managed within each network segment. This layered separation allows networks to scale and function even when connecting very different types of systems.",
  "20": "This slide connects each layer of the TCP/IP model to the actual protocols and technologies that make networks work in practice. At the Application layer, we see protocols like email (SMTP, IMAP, POP) and the web (HTTP), which represent what users interact with directly. The Transport layer uses TCP and UDP to ensure data streams are delivered correctly or quickly, depending on the need. The Network layer relies on IP for addressing and routing packets between devices. At the Data Link layer, technologies like Ethernet and Wi-Fi provide reliable communication across a local connection. Finally, the Physical layer covers how signals are transmitted over media, whether through encoding schemes, fiber optics, or radio. Future lectures will dive into each of these layers and their protocols in more detail, showing how they work individually and how they come together to support the entire network.",
  "21": "The OSI (Open Systems Interconnection) model and the TCP/IP model are both frameworks for understanding how data moves across a network, but they serve slightly different purposes. The OSI model has seven layers, from the Physical layer at the bottom up to the Application layer at the top, and it provides a very detailed, conceptual way of thinking about all the steps involved in communication. It’s excellent for teaching and learning because it breaks everything down into fine-grained pieces, helping students clearly see where tasks like encryption, routing, or error detection fit. However, the OSI model was never fully adopted in practice.\n\nThe TCP/IP model, on the other hand, is the standard used in real-world networks today, including the internet. It simplifies the concepts into five layers (sometimes described as four), combining some of the OSI functions into broader categories. TCP/IP focuses on the protocols that actually run on networks—such as IP for addressing, TCP and UDP for transport, and HTTP, SMTP, or DNS at the application level. Since this course is centered on career readiness, we will focus on the TCP/IP model, as it directly reflects the technologies and skills employers expect students to understand and apply in practice.",
  "22": "This slide summarizes the five layers of the TCP/IP model and the key tasks of each:\n\nPhysical Layer: Concerned with transmitting bits as electrical signals or radio waves; no addressing here, just raw signaling.\n\nData Link Layer: Packages bits into frames for error-free delivery over a single link; uses MAC addresses for identification (Ethernet, Wi-Fi).\n\nNetwork Layer: Handles addressing and routing between devices across networks; data is carried in datagrams/packets using IP addresses.\n\nTransport Layer: Breaks data into segments and ensures it reaches the correct application; uses port numbers; TCP for reliable delivery, UDP for faster, connectionless delivery.\n\nApplication Layer: Where user-level services live—web (HTTP), email (SMTP/IMAP/POP), and many others. The unit here is the message.\n\nThe important point: each layer plays a distinct role, and together they ensure data gets from one user to another reliably.",
  "23": "Earlier we started with some basic networking questions to see what you already knew. Now that we’ve covered the TCP/IP model, how did you do with your answers? By this point, you should be able to explain these confidently and connect them back to the layers we just reviewed.  The answers are: \n\nWhich layer makes sure your email is routed correctly across different networks?→ Network layer (IP) — it handles addressing and routing so the email finds its way to your friend’s system.\n\nWhich layer ensures a downloaded file is complete and correctly ordered?→ Transport layer (TCP) — it manages sequencing, error detection, and retransmission to guarantee reliable delivery.\n\nWhich layer takes care of sending/receiving data through Wi-Fi or Ethernet?→ Data Link layer — it organizes data into frames and uses MAC addresses to deliver across the local connection.\n\nWhich layer is responsible for converting data into signals over cables or wireless?→ Physical layer — it translates bits into electrical signals, light pulses, or radio waves for transmission. ",
  "24": "I’ll be back in person next class on Thu, Aug 28. Thanks for being flexible while I’m on jury duty.\n\nPlease complete the Packet Assignment on Canvas — due before the next class.\n\nNext topic: Layer 1 (Physical layer).\n\nCareer Services will also join us.",
  "25": ""
}
